In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv("C:\\Users\\6126146\\Downloads\\Bengaluru_House_Data.csv")

In [3]:
df.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00

In [4]:
df.shape

(13320, 9)

In [5]:
df.info

<bound method DataFrame.info of                   area_type   availability                  location  \
0      Super built-up  Area         19-Dec  Electronic City Phase II
1                Plot  Area  Ready To Move          Chikka Tirupathi
2            Built-up  Area  Ready To Move               Uttarahalli
3      Super built-up  Area  Ready To Move        Lingadheeranahalli
4      Super built-up  Area  Ready To Move                  Kothanur
...                     ...            ...                       ...
13315        Built-up  Area  Ready To Move                Whitefield
13316  Super built-up  Area  Ready To Move             Richards Town
13317        Built-up  Area  Ready To Move     Raja Rajeshwari Nagar
13318  Super built-up  Area         18-Jun           Padmanabhanagar
13319  Super built-up  Area  Ready To Move              Doddathoguru

            size  society total_sqft  bath  balcony   price
0          2 BHK  Coomee        1056   2.0      1.0   39.07
1      4 Bedroom  Theanmp       2600   5.0      3.0  120.00
2          3 BHK      NaN       1440   2.0      3.0   62.00
3          3 BHK  Soiewre       1521   3.0      1.0   95.00
4          2 BHK      NaN       1200   2.0      1.0   51.00
...          ...      ...        ...   ...      ...     ...
13315  5 Bedroom  ArsiaEx       3453   4.0      0.0  231.00
13316      4 BHK      NaN       3600   5.0      NaN  400.00
13317      2 BHK  Mahla T       1141   2.0      1.0   60.00
13318      4 BHK  SollyCl       4689   4.0      1.0  488.00
13319      1 BHK      NaN        550   1.0      1.0   17.00

[13320 rows x 9 columns]>

In [6]:
df.isnull().sum()

area_type          0
availability       0
location           1
size              16
society         5502
total_sqft         0
bath              73
balcony          609
price              0
dtype: int64

## Dropping availability, society and balcony.

In [7]:
df.drop(columns=['availability', 'location', 'society', 'balcony'], inplace = True)

In [8]:
df.head()

              area_type       size total_sqft  bath   price
0  Super built-up  Area      2 BHK       1056   2.0   39.07
1            Plot  Area  4 Bedroom       2600   5.0  120.00
2        Built-up  Area      3 BHK       1440   2.0   62.00
3  Super built-up  Area      3 BHK       1521   3.0   95.00
4  Super built-up  Area      2 BHK       1200   2.0   51.00

In [9]:
df.isnull().sum()

area_type      0
size          16
total_sqft     0
bath          73
price          0
dtype: int64

In [10]:
def value_counts(x):
    results = df[x].value_counts()
    return results

## Categorizing 'area_type' column.

In [11]:
value_counts('area_type')

Super built-up  Area    8790
Built-up  Area          2418
Plot  Area              2025
Carpet  Area              87
Name: area_type, dtype: int64

In [12]:
category_map = {
    'Super built-up  Area' : 1,
    'Built-up  Area' : 2,
    'Plot  Area' : 3,
    'Carpet  Area' : 4
}

df['area_type'] = df['area_type'].replace(category_map)

In [13]:
df.head()

   area_type       size total_sqft  bath   price
0          1      2 BHK       1056   2.0   39.07
1          3  4 Bedroom       2600   5.0  120.00
2          2      3 BHK       1440   2.0   62.00
3          1      3 BHK       1521   3.0   95.00
4          1      2 BHK       1200   2.0   51.00

## Converting 'size'.

In [14]:
df['size'] = df['size'].str.replace(' BHK', '')
df['size'] = df['size'].str.replace(' Bedroom', '')
df['size'] = df['size'].str.replace(' RK', '')

In [15]:
df['size'] = pd.to_numeric(df['size'], errors='coerce')

In [16]:
df['size'] = df['size'].fillna(df['size'].mode()[0])

In [17]:
df.isnull().sum()

area_type      0
size           0
total_sqft     0
bath          73
price          0
dtype: int64

In [18]:
df.head()

   area_type  size total_sqft  bath   price
0          1   2.0       1056   2.0   39.07
1          3   4.0       2600   5.0  120.00
2          2   3.0       1440   2.0   62.00
3          1   3.0       1521   3.0   95.00
4          1   2.0       1200   2.0   51.00

In [19]:
df['size'] = df['size'].astype(int)

In [20]:
df.head()

   area_type  size total_sqft  bath   price
0          1     2       1056   2.0   39.07
1          3     4       2600   5.0  120.00
2          2     3       1440   2.0   62.00
3          1     3       1521   3.0   95.00
4          1     2       1200   2.0   51.00

## Handling null values in 'bath'.

In [21]:
df['bath'] = df['bath'].fillna(df['bath'].mode()[0])

In [22]:
df['bath'] = df['bath'].astype(int)

In [23]:
df.isnull().sum()

area_type     0
size          0
total_sqft    0
bath          0
price         0
dtype: int64

## Handling range values in 'total_sqft'.

In [24]:
df['total_sqft'] = df['total_sqft'].str.split('-').str[0].str.strip()

In [25]:
df['total_sqft'] = pd.to_numeric(df['total_sqft'], errors='coerce')

In [26]:
mean_value_1 = df['total_sqft'].median()
df['total_sqft'].fillna(mean_value_1, inplace=True)

In [27]:
df.head()

   area_type  size  total_sqft  bath   price
0          1     2      1056.0     2   39.07
1          3     4      2600.0     5  120.00
2          2     3      1440.0     2   62.00
3          1     3      1521.0     3   95.00
4          1     2      1200.0     2   51.00

In [28]:
df['total_sqft'] = df['total_sqft'].astype(int)

In [29]:
df.head()

   area_type  size  total_sqft  bath   price
0          1     2        1056     2   39.07
1          3     4        2600     5  120.00
2          2     3        1440     2   62.00
3          1     3        1521     3   95.00
4          1     2        1200     2   51.00

## Converting values in price to integer.

In [30]:
df['price'] = df['price'].astype(int)

In [31]:
df.head()

   area_type  size  total_sqft  bath  price
0          1     2        1056     2     39
1          3     4        2600     5    120
2          2     3        1440     2     62
3          1     3        1521     3     95
4          1     2        1200     2     51

## Sorting location column.

value_counts('location')

location_mapping = {
    'Whitefield': 1,
    'Sarjapur Road': 2,
    'Electronic City': 3,
    'Kanakpura': 4,
    'Thanisandra': 5
}

df['location'] = df['location'].map(location_mapping).fillna(6).astype(int)

In [32]:
df.head()

   area_type  size  total_sqft  bath  price
0          1     2        1056     2     39
1          3     4        2600     5    120
2          2     3        1440     2     62
3          1     3        1521     3     95
4          1     2        1200     2     51

In [33]:
df.isnull().sum()

area_type     0
size          0
total_sqft    0
bath          0
price         0
dtype: int64

In [34]:
X = df[['area_type', 'size', 'total_sqft', 'bath']]
y = df['price']

In [43]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X, y, train_size = 0.75, random_state = 42)

In [44]:
print(X_train.shape)
print(X_test.shape)
print(y_train.shape)
print(y_test.shape)

(9990, 4)
(3330, 4)
(9990,)
(3330,)

In [45]:
from sklearn.linear_model import LinearRegression

In [46]:
lr = LinearRegression()

In [47]:
lr.fit(X_train, y_train)

LinearRegression()

In [48]:
y_pred = lr.predict(X_test)
y_pred

array([ 78.23316269, 119.13758996,  80.74289734, ...,  71.30578491,
        56.74932394,  66.53728907])

In [49]:
from sklearn.metrics import r2_score

In [50]:
print(r2_score(y_test, y_pred))

0.5034503714636809